Autodesk.Revit.DB.Mechanical.SystemZoneData.Create
Creates a new instance of a system-zone data domain class.
Returns:
The newly created data domain instance.
Since:
2020

Autodesk.Revit.DB.Mechanical.SystemZoneData.ZoneEquipmentId
The id of the zone equipment related to the zone.
Since:
2020

Autodesk.Revit.DB.Mechanical.SystemZoneData
Represents the specific domain requirements for a system-zone used in MEP design.
Remarks:
A system-zone is used to specify what parts of a building are served by specific equipment, air systems and water
loops without having to physically model them. A system-zone is represented as a GenericZone element with a domain
data of type SystemZoneData, which contains specific domain requirements for the purpose of analysis.
Since:
2020